In [ ]:
import pandas
e = pandas.read_excel(r"C:\Users\E15\PycharmProjects\AI_Level_1_Bat_5\pythonlesson\file2.xlsx", sheet_name='Sheet2')
# dropna()
# e.dropna(inplace=True)

# e.loc[7]
# e.iloc[7,0]

e.loc[7, 'Address'] = 'Yangon'

# mean(),  sum() , min(), max(), count()
e['Age'].max()

np.float64(65.0)

In [34]:
data = {
    'Department': ['IT', 'IT', 'HR', 'HR', 'Finance', 'Finance'],
    'Employee': ['A', 'B', 'C', 'D', 'E', 'F'],
    'Salary': [6000, 7000, 4000, 4500, 8000, 7500],
    'Bonus': [500, 600, 200, 250, 800, 750]
}

df = pandas.DataFrame(data)
df

  Department Employee  Salary  Bonus
0         IT        A    6000    500
1         IT        B    7000    600
2         HR        C    4000    200
3         HR        D    4500    250
4    Finance        E    8000    800
5    Finance        F    7500    750

In [40]:
df.groupby('Department')['Salary'].sum()
df.groupby('Department')[['Salary','Bonus']].agg(['mean', 'sum', 'max'])
df.groupby('Department').agg({
    'Salary':'sum', 'Bonus':['mean','sum']
    })

           Salary  Bonus
              sum   mean   sum
Department
Finance     15500  775.0  1550
HR           8500  225.0   450
IT          13000  550.0  1100